---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.OpenAndSolidGeometry
source: html/9a9234c1-eb45-6067-8506-f8eda5e4c581.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.OpenAndSolidGeometry Property

Mass contains both solid and mesh geometry. Mass Floors, volume, and surface area, may appear incorrect.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpenAndSolidGeometry { get; }
```